# 4. Представлен список чисел. Определить элементы списка, не имеющие повторений.
# Сформировать итоговый массив чисел, соответствующих требованию.
# Элементы вывести в порядке их следования в исходном списке.
# Для выполнения задания обязательно использовать генератор.
# Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
# Результат: [23, 1, 3, 10, 4, 11]

import random

random_list = [random.randint(1, 10) for i in range(15)]
new_list = [i for i in random_list if random_list.count(i) < 2]

print(f'Исходный список: {random_list}')
print(f'Список без повторений: {new_list}')
